package com.hearme.cnlunar

import com.hearme.cnlunar.config.mrY13
import com.hearme.cnlunar.tools.diff_day_number
import java.util.*
import kotlin.collections.ArrayList

class Angel(){
    var a = ""
    lateinit var b:Any
    lateinit var c:Any
    var contece = false
    lateinit var d : List<String>
    lateinit var e : List<String>
    constructor(a:String, b:String, c:String, d: List<String>, e: List<String>) : this() {
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String, b:Boolean, c:List<Boolean>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String, b:Char, c:String, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String, b:Char, c:Char, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b == c
    }
}

class Demon(){
    var a = ""
    lateinit var b:Any
    lateinit var c:Any
    var contece = false
    lateinit var d : List<String>
    lateinit var e : List<String>
    constructor(a:String,b:Boolean, c:List<Boolean>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:Char, c:String, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:Int, c:List<Int>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:Int, c:IntRange, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:List<Int>, c:List<Pair<Int,Int>>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = Pair(b[0],b[1]) in c
    }
    constructor(a:String,b:Pair<Int,String>, c:List<Pair<Int,String>>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:String, c:String,d: List<String>,e: List<String>) : this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
    constructor(a:String,b:String, c:List<String>, d: List<String>, e: List<String>):this(){
        this.a = a
        this.b = b
        this.c = c
        this.d = d
        this.e = e
        this.contece = b in c
    }
}

class GbDic(){
    var goodName = ArrayList<String>()
    var badName = ArrayList<String>()
    var goodThing = ArrayList<String>()
    var badThing = ArrayList<String>()

    constructor(goodName:ArrayList<String>, badName:ArrayList<String>,
        goodThing:ArrayList<String>, badThing:ArrayList<String>):this(){
        this.goodName = goodName
        this.badName = badName
        this.goodThing = goodThing
        this.badThing = badThing
    }
}

fun get_demons(den:Int, yen:Int, men:Int, d:String,
               ldn:Int, lmn:Int, sn:Int, tmd:List<Int>,
               t4j:ArrayList<Pair<Int, Int>>, t4l:ArrayList<Pair<Int, Int>>,
               nextSolarTermYear:Int, twys:Pair<Int,Int>, date:Calendar): List<Demon> {
    val demons = listOf(
        Demon(
            "岁破", den == (yen + 6) % 12, listOf(true), listOf(), listOf(
                "修造", "搬移", "嫁娶",
                "出行"
            )
        ), //# 《广圣历》曰：“岁破者，太岁所冲之辰也。其地不可兴造、移徙，嫁娶、远行，犯者主损财物及害家长，惟战伐向之吉。
        Demon("天罡", "卯戌巳子未寅酉辰亥午丑申"[men], d, listOf(), listOf("安葬")),
        Demon("河魁", "酉辰亥午丑申卯戌巳子未寅"[men], d, listOf(), listOf("安葬")),
        Demon(
            "死神", "卯辰巳午未申酉戌亥子丑寅"[men], d, listOf(), listOf(
                "安抚边境", "选将", "出师",
                "进人口", "解除", "求医疗病", "修置产室", "栽种", "牧养", "纳畜"
            )
        ),
        //# ("勾绞", "酉辰亥午丑申卯戌巳子未寅"[men], d,listOf(), (]),
        Demon(
            "死气", "辰巳午未申酉戌亥子丑寅卯"[men], d, listOf(), listOf(
                "安抚边境", "选将", "出师",
                "解除", "求医疗病", "修置产室", "栽种"
            )
        ),
        Demon("官符", "辰巳午未申酉戌亥子丑寅卯"[men], d, listOf(), listOf("上表章", "上册")),
        Demon(
            "月建", "子丑寅卯辰巳午未申酉戌亥"[men], d, listOf(),
            listOf(
                "祈福", "求嗣", "上册", "上表章", "结婚姻", "纳采", "解除", "整容", "剃头", "整手足甲",
                "求医疗病", "营建", "修宫室", "缮城郭", "修造", "竖柱上梁", "修仓库", "开仓", "修置产室",
                "破屋坏垣", "伐木", "栽种", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "月破", "午未申酉戌亥子丑寅卯辰巳"[men], d, listOf("破屋坏垣"), listOf(
                "祈福", "求嗣",
                "上册", "上表章", "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带",
                "出行", "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移",
                "安床", "整容", "剃头", "整手足甲", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁",
                "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠", "穿井",
                "安碓硙", "塞穴", "补垣", "修饰垣墙", "伐木", "栽种", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "月煞", "未辰丑戌未辰丑戌未辰丑戌"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册", "上表章",
                "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带", "出行", "安抚边境",
                "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床", "解除", "整容",
                "剃头", "整手足甲", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁",
                "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠", "穿井",
                "安碓硙", "塞穴", "补垣", "修饰垣墙", "破屋坏垣", "栽种", "牧养", "纳畜", "安葬"
            )
        ),
        Demon(
            "月害", "未午巳辰卯寅丑子亥戌酉申"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册", "上表章",
                "庆赐", "宴会", "安抚边境", "选将", "出师", "上官", "纳采", "嫁娶", "进人口", "求医疗病", "修仓库",
                "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "月刑", "卯戌巳子辰申午丑寅酉未亥"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册", "上表章",
                "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带", "出行", "安抚边境", "选将",
                "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床", "解除", "整容", "剃头",
                "整手足甲", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁", "修仓库",
                "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠", "穿井", "安碓硙",
                "塞穴", "补垣", "修饰垣墙", "破屋坏垣", "栽种", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "月厌", "子亥戌酉申未午巳辰卯寅丑"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册",
                "上表章", "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带", "出行",
                "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "远回",
                "安床", "解除", "整容", "剃头", "整手足甲", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防",
                "修造", "竖柱上梁", "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室",
                "开渠", "穿井", "安碓硙", "塞穴", "补垣", "修饰垣墙", "平治道涂", "破屋坏垣", "伐木", "栽种", "牧养",
                "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon("月忌", ldn, listOf(5, 14, 23), listOf(), listOf("出行", "乘船渡水")),
        Demon("月虚", "未辰丑戌未辰丑戌未辰丑戌"[men], d, listOf(), listOf("修仓库", "纳财", "开仓")),
        Demon(
            "灾煞", "午卯子酉午卯子酉午卯子酉"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册", "上表章",
                "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带", "出行", "安抚边境",
                "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床", "解除", "整容",
                "剃头", "整手足甲", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁",
                "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠", "穿井",
                "安碓硙", "塞穴", "补垣", "修饰垣墙", "破屋坏垣", "栽种", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "劫煞", "巳寅亥申巳寅亥申巳寅亥申"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册",
                "上表章", "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐", "宴会", "冠带", "出行",
                "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床",
                "解除", "整容", "剃头", "整手足甲", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造",
                "竖柱上梁", "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠",
                "穿井", "安碓硙", "塞穴", "补垣", "修饰垣墙", "破屋坏垣", "栽种", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon("厌对", "午巳辰卯寅丑子亥戌酉申未"[men], d, listOf(), listOf("嫁娶")),  //# 六仪招摇
        Demon("招摇", "午巳辰卯寅丑子亥戌酉申未"[men], d, listOf(), listOf("取鱼", "乘船渡水")),  //# 六仪厌对
        Demon("小红砂", "酉丑巳酉丑巳酉丑巳酉丑巳"[men], d, listOf(), listOf("嫁娶")),
        //# ("人隔", "丑亥酉未巳卯丑亥酉未巳卯"[men], d, ["嫁娶", "进人")),
        Demon(
            "往亡", "戌丑寅巳申亥卯午酉子辰未"[men], d, listOf(), listOf(
                "上册", "上表章", "颁诏",
                "招贤", "宣政事", "出行", "安抚边境", "选将", "出师", "上官", "临政", "嫁娶", "进人口", "搬移",
                "求医疗病", "捕捉", "畋猎", "取鱼"
            )
        ),
        Demon("重丧", "癸己甲乙己丙丁己庚辛己壬"[men], d, listOf(), listOf("嫁娶", "安葬")),
        Demon("重复", "癸己庚辛己壬癸戊甲乙己壬"[men], d, listOf(), listOf("嫁娶", "安葬")),
        Demon(
            "杨公忌",
            listOf(lmn, ldn),
            mrY13,
            listOf(),
            listOf("开张", "修造", "嫁娶", "立券")
        ),  //# 杨筠松根据“二十八星宿”顺数，订定了“杨公十三忌”
        Demon("神号", "申酉戌亥子丑寅卯辰巳午未"[men], d, listOf(), listOf()),
        Demon("妨择", "辰辰午午申申戌戌子子寅寅"[men], d, listOf(), listOf()),
        Demon("披麻", "午卯子酉午卯子酉午卯子酉"[men], d, listOf(), listOf("嫁娶", "入宅")),
        //# ("冰消瓦陷", "酉辰巳子丑申卯戌亥午未寅"[men], d,listOf(), ("修造")),
        Demon(
            "大耗", "辰巳午未申酉戌亥子丑寅卯"[men], d, listOf(), listOf(
                "修仓库", "开市",
                "立券交易", "纳财", "开仓"
            )
        ),  //# 历例曰：“大耗者，岁中虚耗之神也。所理之地不可营造仓库、纳财物
        Demon("伏兵", "丙甲壬庚"[yen % 4], d[0].toString(), listOf(), listOf("修仓库", "修造", "出师")),
        Demon("大祸", "丁乙癸辛"[yen % 4], d[0].toString(), listOf(), listOf("修仓库", "修造", "出师")),
        Demon(
            "天吏", "卯子酉午卯子酉午卯子酉午"[men], d, listOf(), listOf(
                "祈福", "求嗣", "上册", "上表章",
                "施恩", "招贤", "举正直", "冠带", "出行", "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采",
                "嫁娶", "进人口", "搬移", "安床", "解除", "求医疗病", "营建", "修宫室", "缮城郭", "筑堤防", "修造",
                "竖柱上梁", "修仓库", "开市", "立券交易", "纳财", "开仓", "修置产室", "栽种", "牧养", "纳畜"
            )
        ),
        Demon("天瘟", "丑卯未戌辰寅午子酉申巳亥"[men], d, listOf(), listOf("修造", "求医疗病", "纳畜")),  //# 参考修正
        Demon("天狱", "午酉子卯午酉子卯午酉子卯"[men], d, listOf(), listOf()),
        Demon("天火", "午酉子卯午酉子卯午酉子卯"[men], d, listOf(), listOf("苫盖")),
        Demon("天棒", "寅辰午申戌子寅辰午申戌子"[men], d, listOf(), listOf()),
        Demon("天狗", "寅卯辰巳午未申酉戌亥子丑"[men], d, listOf(), listOf("祭祀")),
        Demon("天狗下食", "戌亥子丑寅卯辰巳午未申酉"[men], d, listOf(), listOf("祭祀")),
        Demon("天贼", "卯寅丑子亥戌酉申未午巳辰"[men], d, listOf(), listOf("出行", "修仓库", "开仓")),
        Demon(
            "地囊", d, listOf(
                "辛未辛酉", "乙酉乙未", "庚子庚午", "癸未癸丑", "甲子甲寅", "己卯己丑",
                "戊辰戊午", "癸未癸巳", "丙寅丙申", "丁卯丁巳", "戊辰戊子", "庚戌庚子",
            )[men],
            listOf(), listOf(
                "营建", "修宫室", "缮城郭", "筑堤防", "修造", "修仓库", "修置产室", "开渠",
                "穿井", "安碓硙", "补垣", "修饰垣墙", "平治道涂", "破屋坏垣", "栽种", "破土"
            )
        ),
        Demon("地火", "子亥戌酉申未午巳辰卯寅丑"[men], d, listOf(), listOf("栽种")),
        Demon("独火", "未午巳辰卯寅丑子亥戌酉申"[men], d, listOf(), listOf("修造")),
        Demon("受死", "卯酉戌辰亥巳子午丑未寅申"[men], d, listOf(), listOf("畋猎")),
        Demon("黄沙", "寅子午寅子午寅子午寅子午"[men], d, listOf(), listOf("出行")),
        Demon("六不成", "卯未寅午戌巳酉丑申子辰亥"[men], d, listOf(), listOf("修造")),
        Demon(
            "小耗", "卯辰巳午未申酉戌亥子丑寅"[men], d, listOf(), listOf(
                "修仓库", "开市", "立券交易",
                "纳财", "开仓"
            )
        ),
        Demon("神隔", "酉未巳卯丑亥酉未巳卯丑亥"[men], d, listOf(), listOf("祭祀", "祈福")),
        Demon("朱雀", "亥丑卯巳未酉亥丑卯巳未酉"[men], d, listOf(), listOf("嫁娶")),
        Demon("白虎", "寅辰午申戌子寅辰午申戌子"[men], d, listOf(), listOf("安葬")),
        Demon("玄武", "巳未酉亥丑卯巳未酉亥丑卯"[men], d, listOf(), listOf("安葬")),
        Demon("勾陈", "未酉亥丑卯巳未酉亥丑卯巳"[men], d, listOf(), listOf()),
        Demon("木马", "辰午巳未酉申戌子亥丑卯寅"[men], d, listOf(), listOf()),
        Demon("破败", "辰午申戌子寅辰午申戌子寅"[men], d, listOf(), listOf()),
        Demon("殃败", "巳辰卯寅丑子亥戌酉申未午"[men], d, listOf(), listOf()),
        Demon("雷公", "巳申寅亥巳申寅亥巳申寅亥"[men], d, listOf(), listOf()),
        Demon("飞廉", "申酉戌巳午未寅卯辰亥子丑"[men], d, listOf(), listOf("纳畜", "修造", "搬移", "嫁娶")),
        Demon("大煞", "申酉戌巳午未寅卯辰亥子丑"[men], d, listOf(), listOf("安抚边境", "选将", "出师")),
        //# 《神枢经》曰：“飞廉者，岁之廉察使君之象，亦名大煞。所理之不可兴工、动土，搬移，嫁娶《广圣历》曰：“子年在申，丑年在酉，寅年在戌，卯年在巳，辰年在午，巳年在未，午年在寅，未年在卯，申 年在辰，酉年在亥，戌年在子，亥年在丑也。”
        Demon("枯鱼", "申巳辰丑戌未卯子酉午寅亥"[men], d, listOf(), listOf("栽种")),
        Demon(
            "九空",
            "申巳辰丑戌未卯子酉午寅亥"[men],
            d,
            listOf(),
            listOf("进人口", "修仓库", "开市", "立券交易", "纳财", "开仓")
        ),
        Demon("八座", "酉戌亥子丑寅卯辰巳午未申"[men], d, listOf(), listOf()),
        Demon(
            "八风触水龙", d, listOf("丁丑己酉", "甲申甲辰", "辛未丁未", "甲戌甲寅")[sn], listOf(),
            listOf("取鱼", "乘船渡水")
        ),
        Demon("血忌", "午子丑未寅申卯酉辰戌巳亥"[men], d, listOf(), listOf("针刺")),
        Demon(
            "阴错",
            "壬子癸丑庚寅辛卯庚辰丁巳丙午丁未甲申乙酉甲戌癸亥".substring(men * 2, men * 2 + 2),
            d,
            listOf(),
            listOf()
        ),
        Demon("三娘煞", ldn, listOf(3, 7, 13, 18, 22, 27), listOf(), listOf("嫁娶")),
        Demon(
            "四绝",
            tmd,
            t4j,
            listOf(),
            listOf("出行", "上官", "嫁娶", "进人口", "搬移", "开市", "立券交易", "祭祀")
        ),
        Demon("四离", tmd, t4l, listOf(), listOf("出行", "嫁娶")),
        Demon("四击", "未未戌戌戌丑丑丑辰辰辰未"[men], d, listOf(), listOf("安抚边境", "选将", "出师")),
        //# 四击者,春戌、夏丑、秋辰、冬未。按四击者,四时所冲之墓辰也。如正二三月建寅卯辰,辰与戌冲,故戌为四击也。馀仿此。
        //# ("四正废", d, "庚申辛酉壬子癸亥甲寅乙卯丙午丁巳"[sn * 4:sn * 4 + 4], ["修造", "交易", "安床")),
        Demon(
            "四耗", d, listOf("壬子", "乙卯", "戊午", "辛酉")[sn], listOf(), listOf(
                "安抚边境", "选将",
                "出师", "修仓库", "开市", "立券交易", "纳财", "开仓"
            )
        ),
        Demon(
            "四穷", d, listOf("乙亥", "丁亥", "辛亥", "癸亥")[sn], listOf(), listOf(
                "安抚边境",
                "选将", "出师", "结婚姻", "纳采", "嫁娶", "进人口", "修仓库", "开市", "立券交易", "纳财", "开仓", "安葬"
            )
        ),
        Demon(
            "四忌", d, listOf("甲子", "丙子", "庚子", "壬子")[sn], listOf(), listOf(
                "安抚边境", "选将",
                "出师", "结婚姻", "纳采", "嫁娶", "安葬"
            )
        ),
        Demon(
            "四废", d, listOf("庚申辛酉", "壬子癸亥", "甲寅乙卯", "丁巳丙午")[sn], listOf(),
            listOf(
                "祈福", "求嗣", "上册", "上表章", "颁诏", "施恩", "招贤", "举正直", "宣政事", "布政事", "庆赐",
                "宴会", "冠带", "出行", "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口",
                "搬移", "安床", "解除", "求医疗病", "裁制", "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁",
                "修仓库", "鼓铸", "经络", "酝酿", "开市", "立券交易", "纳财", "开仓", "修置产室", "开渠", "穿井",
                "安碓硙", "塞穴", "补垣", "修饰垣墙", "栽种", "牧养", "纳畜", "破土", "安葬", "启攒"
            )
        ), // # 庚申辛酉为春废，壬子癸亥夏时当。甲寅乙卯秋月值，丁巳丙午冬季防。
        Demon(
            "五墓", listOf(
                "壬辰", "戊辰", "乙未", "乙未", "戊辰", "丙戌", "丙戌", "戊辰", "辛丑",
                "辛丑", "戊辰", "壬辰"
            )[men], d, listOf(), listOf(
                "冠带", "出行", "安抚边境", "选将", "出师",
                "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床", "解除", "求医疗病", "营建",
                "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁", "开市", "立券交易", "修置产室", "栽种", "牧养",
                "纳畜", "破土", "安葬", "启攒"
            )
        ),
        Demon(
            "五虚",
            d[1],
            listOf("巳酉丑", "申子辰", "亥卯未", "寅午戌")[sn],
            listOf(),
            listOf("修仓库", "开仓")
        ),
        Demon("五离", d[1], "申酉", listOf("沐浴"), listOf("庆赐", "宴会", "结婚姻", "纳采", "立券交易")),  //# 除神
        Demon("五鬼", "未戌午寅辰酉卯申丑巳子亥"[men], d, listOf(), listOf("出行")),
        Demon(
            "八专",
            d,
            listOf("丁未", "己未", "庚申", "甲寅", "癸丑"),
            listOf(),
            listOf("安抚边境", "选将", "出师", "结婚姻", "纳采", "嫁娶")
        ),
        Demon("九坎", "申巳辰丑戌未卯子酉午寅亥"[men], d, listOf(), listOf("塞穴", "补垣", "取鱼", "乘船渡水")),
        //# 《广圣历》曰:九坎者,月中杀神也。其日忌乘船渡水、修堤防、筑垣墙、苫盖屋舍。《历例》曰:九坎者,正月在辰逆行四季,五月在卯逆行四仲,九月在寅逆行四孟。
        Demon("九焦", "申巳辰丑戌未卯子酉午寅亥"[men], d, listOf(), listOf("鼓铸", "栽种")),
        //# 天转有四日，分别是春季的乙卯日，夏季的丙午日，秋季的辛酉日，冬季的壬子日。
        //# 地转也有四日，分别是春季的辛卯日，夏季的戊午日，秋季的癸酉日，冬季的丙子日。
        //# “春季乙辛到兔位，夏天丙戊马上求；秋来辛癸听鸡叫，冬寒丙壬鼠洞留”。
        Demon(
            "天转",
            "乙卯丙午辛酉壬子".substring(sn * 2, sn * 2 + 2),
            d,
            listOf(),
            listOf("修造", "搬移", "嫁娶")
        ),
        Demon(
            "地转",
            "辛卯戊午癸酉丙子".substring(sn * 2, sn * 2 + 2),
            d,
            listOf(),
            listOf("修造", "搬移", "嫁娶")
        ),
        Demon("月建转杀", "卯午酉子"[sn], d, listOf(), listOf("修造")),
        Demon("荒芜", d[1], "巳酉丑申子辰亥卯未寅午戌".substring(sn * 3, sn * 3 + 3), listOf(), listOf()),

        Demon(
            "蚩尤",
            "戌子寅辰午申"[men % 6],
            d,
            listOf(),
            listOf()
        ),  //# 正七逢寅二八辰，三九午上四十申。五十一月原在戌，六十二月子为真。
        Demon(
            "大时", "酉午卯子酉午卯子酉午卯子"[men], d, listOf(),
            listOf(
                "祈福", "求嗣", "上册", "上表章", "施恩", "招贤", "举正直", "冠带", "出行", "安抚边境", "选将",
                "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "安床", "解除", "求医疗病",
                "营建", "修宫室", "缮城郭", "筑堤防", "修造", "竖柱上梁", "修仓库", "开市", "立券交易", "纳财", "开仓",
                "修置产室", "栽种", "牧养", "纳畜"
            )
        ),
        //# 《神枢经》曰:大时者,将军之象也。所直之日,忌出军攻战、筑室会亲。李鼎祚曰:大时者,正月起卯逆行四仲。
        Demon("大败", "酉午卯子酉午卯子酉午卯子"[men], d, listOf(), listOf()),
        //# 十恶大败干支纪日分别为：甲辰、乙巳、丙申、丁亥、戊戌、己丑、庚辰、辛巳、壬申、癸亥。（不确定）《总要历》曰:大败者,兵败忌辰也。其日忌临阵侵敌、攻城野战。《历例》曰:正月起卯,逆行四仲。
        //# 《枢要历》曰:五虛者,四时绝辰也。其日忌开仓、营种莳、出财宝、放债负。《历例》曰:五虚者,春巳酉丑,夏申子辰,秋亥卯未,冬寅午戌也。
        Demon(
            "咸池",
            "酉午卯子酉午卯子酉午卯子"[men],
            d,
            listOf(),
            listOf("嫁娶", "取鱼", "乘船渡水")
        ),  //# 《历例》曰:咸池者,正月起卯,逆行四仲;
        //# 《历例》曰:士符者,正月丑，二月已,三月酉,四月寅,五月午,六月戌,七月卯,八月未,九月亥,十月辰,十一月申,十二月子。
        Demon(
            "土符", "申子丑巳酉寅午戌卯未亥辰"[men], d, listOf(),
            listOf(
                "营建", "修宫室", "缮城郭", "筑堤防", "修造", "修仓库", "修置产室", "开渠", "穿井", "安碓硙",
                "补垣", "修饰垣墙", "平治道涂", "破屋坏垣", "栽种", "破土"
            )
        ),
        Demon(
            "土府", "子丑寅卯辰巳午未申酉戌亥"[men], d, listOf(),
            listOf(
                "营建", "修宫室", "缮城郭", "筑堤防", "修造", "修仓库", "修置产室", "开渠", "穿井", "安碓硙",
                "补垣", "修饰垣墙", "平治道涂", "破屋坏垣", "栽种", "破土"
            )
        ),
        Demon(
            "土王用事", diff_day_number("$nextSolarTermYear-${twys.first}-${twys.second}", date),
            0..17, listOf(), listOf(
                "营建", "修宫室", "缮城郭", "筑堤防", "修造", "修仓库", "修置产室",
                "开渠", "穿井", "安碓硙", "补垣", "修饰垣墙", "平治道涂", "破屋坏垣", "栽种", "破土"
            )
        ),
        Demon("血支", "亥子丑寅卯辰巳午未申酉戌"[men], d, listOf(), listOf("针刺")),
        //# 《广圣历》曰:九焦者,月中杀神也。其日忌炉冶、铸造、种植、修筑园圃。《历例》曰:正月在辰逆行四季,五月在卯逆行四仲,九月在寅逆行四孟。
        Demon("游祸", "亥申巳寅亥申巳寅亥申巳寅"[men], d, listOf(), listOf("祈福", "求嗣", "解除", "求医疗病")),
        //# 官历宜服药?  《神枢经》曰:游祸者,月中恶神也。其日忌服药请医、祀神致祭。李鼎祚曰:游祸者,正月起已逆行四孟。
        Demon("归忌", "寅子丑寅子丑寅子丑寅子丑"[men], d, listOf(), listOf("搬移", "远回")),
        //# 《广圣历》:归忌者,月内凶神也。其日忌远行、归家移徙、娶归、《历例》曰:孟月丑,仲月寅,季月子
        Demon(
            "岁薄", Pair(lmn, d), listOf(
                Pair(4, "戊午"), Pair(4, "丙午"), Pair(10, "壬子"),
                Pair(10, "戊子")
            ), listOf(), listOf()
        ),
        Demon(
            "逐阵", Pair(lmn, d), listOf(
                Pair(6, "戊午"), Pair(6, "丙午"), Pair(12, "壬子"),
                Pair(12, "戊子")
            ), listOf(), listOf()
        ),
        Demon("阴阳交破", Pair(lmn, d), listOf(Pair(10, "丁巳")), listOf(), listOf()),
        Demon(
            "宝日", d, listOf(
                "丁未", "丁丑", "丙戌", "甲午", "庚子", "壬寅", "癸卯", "乙巳", "戊申",
                "己酉", "辛亥", "丙辰"
            ), listOf(), listOf()
        ),
        Demon(
            "义日", d, listOf(
                "甲子", "丙寅", "丁卯", "己巳", "辛未", "壬申", "癸酉", "乙亥", "庚辰",
                "辛丑", "庚戌", "戊午"
            ), listOf(), listOf()
        ),
        Demon(
            "制日", d, listOf(
                "乙丑", "甲戌", "壬午", "戊子", "庚寅", "辛卯", "癸巳", "乙未", "丙申",
                "丁酉", "己亥", "甲辰"
            ), listOf(), listOf()
        ),
        Demon(
            "伐日", d, listOf(
                "庚午", "辛巳", "丙子", "戊寅", "己卯", "癸未", "癸丑", "甲申", "乙酉",
                "丁亥", "壬辰", "壬戌"
            ), listOf(), listOf("安抚边境", "选将", "出师")
        ),
        Demon(
            "专日", d, listOf(
                "甲寅", "乙卯", "丁巳", "丙午", "庚申", "辛酉", "癸亥", "壬子", "戊辰",
                "戊戌", "己丑", "己未"
            ), listOf(), listOf("安抚边境", "选将", "出师")
        ),
        Demon("重日", d[1], "巳亥", listOf(), listOf("破土", "安葬", "启攒")),
        Demon("复日", "癸巳甲乙戊丙丁巳庚辛戊壬"[men], d, listOf("裁制"), listOf("破土", "安葬", "启攒")),
        //# 《天宝历》曰:复日者,为魁罡所系之辰也。其日忌为凶事,利为吉事。《历例》曰:复日者,正、七月甲庚,二、八月乙辛,四十月丙壬,五、十一月丁癸,三、九、六、十二月戊巳日也。
    )
    return demons
}

fun get_angels(yhn:Int,d:String,men:Int,s:String,sn: Int,den: Int,dhen:Int): List<Angel> {
    val angels = listOf(
        Angel(
            "岁德", "甲庚丙壬戊甲庚丙壬戊"[yhn], d, listOf("修造", "嫁娶", "纳采", "搬移", "入宅"),
            listOf("")
        ),
        // # 岁德、岁德合：年天干对日天干["修造","动土","嫁娶","纳采","移徙","入宅","百事皆宜"] 天干相合+5  20190206
        Angel(
            "岁德合", "己乙辛丁癸己乙辛丁癸"[yhn], d, listOf(
                "修造", "赴任", "嫁娶", "纳采", "搬移", "入宅",
                "出行"
            ), listOf("")
        ),  //# 修营、起土，上官。嫁娶、远行，参谒
        Angel(
            "月德", "壬庚丙甲壬庚丙甲壬庚丙甲"[men], d[0], listOf(
                "祭祀", "祈福", "求嗣", "上册", "上表章",
                "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐", "宴会", "出行",
                "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "搬移", "解除", "求医疗病",
                "裁制", "营建", "缮城郭", "修造", "竖柱上梁", "修仓库", "栽种", "牧养", "纳畜", "安葬"
            ),
            listOf("畋猎", "取鱼")
        ),
        //# 月德20190208《天宝历》曰：“月德者，月之德神也。取土、修营宜向其方，宴乐、上官利用其日。
        Angel(
            "月德合", "丁乙辛己丁乙辛己丁乙辛己"[men], d[0], listOf(
                "祭祀", "祈福", "求嗣",
                "上册", "上表章", "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐",
                "宴会", "出行", "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "搬移",
                "解除", "求医疗病", "裁制", "营建", "缮城郭", "修造", "竖柱上梁", "修仓库", "栽种", "牧养",
                "纳畜", "安葬"
            ), listOf("畋猎", "取鱼")
        ),
        Angel(
            "天德", "巳庚丁申壬辛亥甲癸寅丙乙"[men], d, listOf(
                "祭祀", "祈福", "求嗣", "上册", "上表章",
                "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐", "宴会", "出行",
                "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "搬移", "解除", "求医疗病",
                "裁制", "营建", "缮城郭", "修造", "竖柱上梁", "修仓库", "栽种", "牧养", "纳畜", "安葬"
            ),
            listOf("畋猎", "取鱼")
        ),  //# 天德"巳庚丁申壬辛亥甲癸寅丙乙"天德合"申乙壬巳丁丙寅己戊亥辛庚"
        Angel(
            "天德合", "空乙壬空丁丙空己戊空辛庚"[men], d, listOf(
                "祭祀", "祈福", "求嗣", "上册", "上表章",
                "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐", "宴会", "出行",
                "安抚边境", "选将", "出师", "上官", "临政", "结婚姻", "纳采", "嫁娶", "搬移", "解除", "求医疗病",
                "裁制", "营建", "缮城郭", "修造", "竖柱上梁", "修仓库", "栽种", "牧养", "纳畜", "安葬"
            ),
            listOf("畋猎", "取鱼")
        ),
        Angel("凤凰日", s[0], "危昴胃毕"[sn], listOf("嫁娶"), listOf("")),
        Angel(
            "麒麟日",
            s[0],
            "井尾牛壁"[sn],
            listOf("嫁娶"),
            listOf("")
        ),  //# 凤凰日、麒麟日（麒麟日测试日期2019.03.07）
        Angel(
            "三合", ((den - men) % 4 == 0), listOf(true), listOf(
                "庆赐", "宴会", "结婚姻",
                "纳采", "嫁娶", "进人口", "裁制", "修宫室", "缮城郭", "修造", "竖柱上梁", "修仓库", "经络", "酝酿",
                "立券交易", "纳财", "安碓硙", "纳畜"
            ), listOf("")
        ),  //# 三合数在地支上相差4个顺位
        Angel(
            "四相", d[0], listOf("丙丁", "戊己", "壬癸", "甲乙")[sn], listOf(
                "祭祀", "祈福",
                "求嗣", "施恩", "举正直", "庆赐", "宴会", "出行", "上官", "临政", "结婚姻", "纳采", "搬移", "解除",
                "求医疗病", "裁制", "修宫室", "缮城郭", "修造", "竖柱上梁", "纳财", "开仓", "栽种", "牧养"
            ), listOf("")
        ),
        //# 《总要历》曰：“四相者，四时王相之辰也。其日宜修营、起工、养育，生财、栽植、种莳、移徙、远行，曰：“春丙丁，夏戊己，秋壬癸，冬甲乙。
        Angel("五合", d[1], "寅卯", listOf("宴会", "结婚姻", "立券交易"), listOf("")),
        Angel(
            "五富", "巳申亥寅巳申亥寅巳申亥寅"[men], d, listOf(
                "经络", "酝酿", "开市", "立券交易", "纳财",
                "开仓", "栽种", "牧养", "纳畜"
            ), listOf("")
        ),
        Angel(
            "六合", "丑子亥戌酉申未午巳辰卯寅"[men], d, listOf(
                "宴会", "结婚姻", "嫁娶", "进人口", "经络",
                "酝酿", "立券交易", "纳财", "纳畜", "安葬"
            ), listOf("")
        ),
        Angel("六仪", "午巳辰卯寅丑子亥戌酉申未"[men], d, listOf("临政"), listOf("")),  //# 厌对招摇

        Angel("不将", d, config.bujiang[men], listOf("嫁娶"), listOf("")),
        Angel(
            "时德", "午辰子寅"[sn], d[1], listOf(
                "祭祀", "祈福", "求嗣", "施恩", "举正直", "庆赐",
                "宴会", "出行", "上官", "临政", "结婚姻", "纳采", "搬移", "解除", "求医疗病", "裁制", "修宫室",
                "缮城郭", "修造", "竖柱上梁", "纳财", "开仓", "栽种", "牧养"
            ), listOf("")
        ),  //# 时德:春午 夏辰 秋子 冬寅 20190204
        Angel("大葬", d, "壬申癸酉壬午甲申乙酉丙申丁酉壬寅丙午己酉庚申辛酉", listOf("安葬"), listOf("")),
        Angel("鸣吠", d, "庚午壬申癸酉壬午甲申乙酉己酉丙申丁酉壬寅丙午庚寅庚申辛酉", listOf("破土", "安葬"), listOf("")),
        Angel("小葬", d, "庚午壬辰甲辰乙巳甲寅丙辰庚寅", listOf("安葬"), listOf("")),
        //# ("鸣吠对", d, "丙寅丁卯丙子辛卯甲午庚子癸卯壬子甲寅乙卯", ["安葬")),
        Angel("鸣吠对", d, "丙寅丁卯丙子辛卯甲午庚子癸卯壬子甲寅乙卯", listOf("破土", "启攒"), listOf("")),  //# （改）
        Angel(
            "不守塚", d, "庚午辛未壬申癸酉戊寅己卯壬午癸未甲申乙酉丁未甲午乙未丙申丁酉壬寅癸卯丙午戊申己酉庚申辛酉",
            listOf("破土"), listOf("")
        ),
        //# 《钦定协纪辨方书 卷五》《历例》 王日、官日、守日、相日、民日
        Angel(
            "王日", "寅巳申亥"[sn], d[1], listOf(
                "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕",
                "宣政事", "雪冤", "庆赐", "宴会", "出行", "安抚边境", "选将", "上官", "临政", "裁制"
            ), listOf("")
        ),
        Angel("官日", "卯午酉子"[sn], d[1], listOf("上官", "临政"), listOf("")),
        Angel("守日", "酉子卯午"[sn], d[1], listOf("安抚边境", "上官", "临政"), listOf("")),
        Angel("相日", "巳申亥寅"[sn], d[1], listOf("上官", "临政"), listOf("")),
        Angel(
            "民日", "午酉子卯"[sn], d[1], listOf(
                "宴会", "结婚姻", "纳采", "进人口", "搬移", "开市",
                "立券交易", "纳财", "栽种", "牧养", "纳畜"
            ), listOf("")
        ),
        Angel(
            "临日", "辰酉午亥申丑戌卯子巳寅未"[men], d, listOf("上册", "上表章", "上官", "临政"),
            listOf("")
        ), // # 正月午日、二月亥日、三月申日、四月丑日等为临日
        Angel(
            "天贵",
            d[0],
            listOf("甲乙", "丙丁", "庚辛", "壬癸")[sn],
            listOf(""),
            listOf()
        ),//  # 20190216
        Angel(
            "天喜", "申酉戌亥子丑寅卯辰巳午未"[men], d[1], listOf(
                "施恩", "举正直",
                "庆赐", "宴会", "出行", "上官", "临政", "结婚姻", "纳采", "嫁娶"
            ), listOf("")
        ),
        Angel("天富", "寅卯辰巳午未申酉戌亥子丑"[men], d, listOf("安葬", "修仓库"), listOf("")),
        Angel(
            "天恩", ((dhen % 15 < 5) and (dhen / 15 != 2)), listOf(true), listOf(
                "覃恩",
                "恤孤茕", "布政事", "雪冤", "庆赐", "宴会"
            ), listOf("")
        ),
        //# ("月恩", "甲辛丙丁庚己戊辛壬癸庚乙"[men], d,listOf("营造", "婚姻", "移徙", "祭祀", "上官", "纳财", "动土")),#《五行论》曰：“月恩者，阳建所生之干也，子母相从谓之月恩。其日宜营造，婚姻、移徙，祭祀，上官，纳财。”
        Angel(
            "月恩", "甲辛丙丁庚己戊辛壬癸庚乙"[men], d, listOf(
                "祭祀", "祈福", "求嗣", "施恩",
                "举正直", "庆赐", "宴会", "出行", "上官", "临政", "结婚姻", "纳采", "搬移", "解除", "求医疗病",
                "裁制", "修宫室", "缮城郭", "修造", "竖柱上梁", "纳财", "开仓", "栽种", "牧养"
            ), listOf("")
        ),
        Angel(
            "天赦", listOf(
                "甲子", "甲子", "戊寅", "戊寅", "戊寅", "甲午", "甲午", "甲午", "戊申", "戊申",
                "戊申", "甲子"
            )[men], d, listOf(
                "祭祀", "祈福", "求嗣", "上册", "上表章", "颁诏", "覃恩", "施恩",
                "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐", "宴会", "出行", "安抚边境", "选将", "上官",
                "临政", "结婚姻", "纳采", "嫁娶", "搬移", "解除", "求医疗病", "裁制", "营建", "缮城郭", "修造",
                "竖柱上梁", "修仓库", "栽种", "牧养", "纳畜", "安葬"
            ), listOf("畋猎", "取鱼")
        ),
        Angel(
            "天愿", "甲子癸未甲午甲戌乙酉丙子丁丑戊午甲寅丙辰辛卯戊辰"[men], d, listOf(
                "祭祀", "祈福",
                "求嗣", "上册", "上表章", "颁诏", "覃恩", "施恩", "招贤", "举正直", "恤孤茕", "宣政事", "雪冤", "庆赐",
                "宴会", "出行", "安抚边境", "选将", "上官", "临政", "结婚姻", "纳采", "嫁娶", "进人口", "搬移", "裁制",
                "营建", "缮城郭", "修造", "竖柱上梁", "修仓库", "经络", "酝酿", "开市", "立券交易", "纳财", "栽种",
                "牧养", "纳畜", "安葬"
            ), listOf("")
        ),  //# 天愿日，以月之干支为依据，择与之和合之日为是，故为月之喜神
        Angel("天成", "卯巳未酉亥丑卯巳未酉亥丑"[men], d, listOf(), listOf("")),
        Angel("天官", "午申戌子寅辰午申戌子寅辰"[men], d, listOf(), listOf("")),
        Angel(
            "天医",
            "亥子丑寅卯辰巳午未申酉戌"[men],
            d,
            listOf("求医疗病"),
            listOf("")
        ),  //# 《总要历》曰：“天医者，人之巫医。其日宜请药，避病、寻巫、祷祀。
        Angel("天马", "寅辰午申戌子寅辰午申戌子"[men], d, listOf("出行", "搬移"), listOf("")),  //# （改）
        Angel("驿马", "寅亥申巳寅亥申巳寅亥申巳"[men], d, listOf("出行", "搬移"), listOf("")),
        Angel("天财", "子寅辰午申戌子寅辰午申戌"[men], d, listOf(), listOf("")),
        Angel("福生", "寅申酉卯戌辰亥巳子午丑未"[men], d, listOf("祭祀", "祈福"), listOf("")),
        Angel("福厚", "寅巳申亥"[sn], d, listOf(), listOf("")),
        Angel(
            "福德", "寅卯辰巳午未申酉戌亥子丑"[men], d, listOf(
                "上册", "上表章", "庆赐", "宴会", "修宫室",
                "缮城郭"
            ), listOf("")
        ),
        Angel("天巫", "寅卯辰巳午未申酉戌亥子丑"[men], d, listOf("求医疗病"), listOf("")),
        Angel("地财", "丑卯巳未酉亥丑卯巳未酉亥"[men], d, listOf(), listOf("")),
        Angel("月财", "酉亥午巳巳未酉亥午巳巳未"[men], d, listOf(), listOf("")),
        //# ("月空", "丙甲壬庚丙甲壬庚丙甲壬庚"[men], d,listOf("上书", "陈策", "造床", "修屋", "动土")),#《天宝历》曰：“月中之阳辰也。所理之日宜设筹谋。陈计策。
        Angel(
            "月空",
            "丙甲壬庚丙甲壬庚丙甲壬庚"[men],
            d,
            listOf("上表章"),
            listOf("")
        ),  //# 《天宝历》曰：“月中之阳辰也。所理之日宜设筹谋。陈计策。#（改）
        Angel(
            "母仓", d[1], listOf("亥子", "寅卯", "辰丑戌未", "申酉")[sn],
            listOf("纳财", "栽种", "牧养", "纳畜"), listOf("")
        ),
        Angel("明星", "辰午甲戌子寅辰午甲戌子寅"[men], d, listOf("赴任", "诉讼", "安葬"), listOf("")),
        Angel("圣心", "辰戌亥巳子午丑未寅申卯酉"[men], d, listOf("祭祀", "祈福"), listOf("")),
        Angel("禄库", "寅卯辰巳午未申酉戌亥子丑"[men], d, listOf("纳财"), listOf("")),

        Angel("吉庆", "未子酉寅亥辰丑午卯申巳戌"[men], d, listOf(), listOf("")),
        Angel("阴德", "丑亥酉未巳卯丑亥酉未巳卯"[men], d, listOf("恤孤茕", "雪冤"), listOf("")),
        Angel("活曜", "卯申巳戌未子酉寅亥辰丑午"[men], d, listOf(), listOf("")),
        Angel(
            "除神", d[1], "申酉", listOf(
                "解除", "沐浴", "整容", "剃头", "整手足甲",
                "求医疗病", "扫舍宇"
            ), listOf("")
        ),  //# 五离
        Angel(
            "解神", "午午申申戌戌子子寅寅辰辰"[men], d, listOf(
                "上表章", "解除", "沐浴", "整容", "剃头",
                "整手足甲", "求医疗病"
            ), listOf("")
        ),
        Angel("生气", "戌亥子丑寅卯辰巳午未申酉"[men], d, listOf(), listOf("伐木", "畋猎", "取鱼")),
        Angel("普护", "丑卯申寅酉卯戌辰亥巳子午"[men], d, listOf("祭祀", "祈福"), listOf("")),
        Angel("益后", "巳亥子午丑未寅申卯酉辰戌"[men], d, listOf("祭祀", "祈福", "求嗣"), listOf("")),
        Angel("续世", "午子丑未寅申卯酉辰戌巳亥"[men], d, listOf("祭祀", "祈福", "求嗣"), listOf("")),
        Angel("要安", "未丑寅申卯酉辰戌巳亥午子"[men], d, listOf(), listOf("")),
        Angel("天后", "寅亥申巳寅亥申巳寅亥申巳"[men], d, listOf("求医疗病"), listOf("")),
        Angel("天仓", "辰卯寅丑子亥戌酉申未午巳"[men], d, listOf("进人口", "纳财", "纳畜"), listOf("")),
        //# 《总要历》曰:天仓者,天库之神也。其日可以修仓库、受赏赐、纳财、牧养。《历例》曰:天仓者,正月起寅,逆行十二辰。
        Angel("敬安", "子午未丑申寅酉卯戌辰亥巳"[men], d, listOf(), listOf("")),  //# 恭顺之神当值
        Angel("玉宇", "申寅卯酉辰戌巳亥午子未丑"[men], d, listOf(), listOf("")),
        Angel("金堂", "酉卯辰戌巳亥午子未丑申寅"[men], d, listOf(), listOf("")),
        Angel(
            "吉期", "丑寅卯辰巳午未申酉戌亥子"[men], d, listOf("施恩", "举正直", "出行", "上官", "临政"),
            listOf("")
        ),
        Angel("小时", "子丑寅卯辰巳午未申酉戌亥"[men], d, listOf(), listOf("")),
        Angel("兵福", "子丑寅卯辰巳午未申酉戌亥"[men], d, listOf("安抚边境", "选将", "出师"), listOf("")),
        Angel("兵宝", "丑寅卯辰巳午未申酉戌亥子"[men], d, listOf("安抚边境", "选将", "出师"), listOf("")),
        Angel(
            "兵吉", d[1], listOf(
                "寅卯辰巳", "丑寅卯辰", "子丑寅卯", "亥子丑寅", "戌亥子丑",
                "酉戌亥子", "申酉戌亥", "未申酉戌", "午未申酉", "巳午未申", "辰巳午未", "卯辰巳午"
            )[men],
            listOf("安抚边境", "选将", "出师"), listOf("")
        ),
    )
    return angels
}

